{
  "1.0.0": {
    "en": "First version!"
  },
  "1.0.1": {
    "en": "Take Homey's TZ into consideration in the UI"
  },
  "1.0.2": {
    "en": "Fixed devices not restoring during capacity shortfall. Burst rate now only limited in last 10 minutes of the hour. Added dry-run warning banner. Added end-of-hour indicator in plan view."
  },
  "1.0.3": {
    "en": "Improved settings UI with better spacing and navigation. Added stale data warning banner. Improved price display with collapsible summary. Renamed insights driver with new icon."
  },
  "1.0.4": {
    "en": "Fix shortfall detection during end of hour"
  },
  "1.0.5": {
    "en": "Renaming modes should now be safe"
  },
  "1.1.0": {
    "en": "Added new card for when operating mode changes"
  },
  "1.1.1": {
    "en": "Improved flow card UX: removed parentheses from report power card title and added helpful usage hints. All flow cards now provide clear guidance on how to use them with practical examples."
  },
  "1.2.0": {
    "en": "Add some new flow cards"
  },
  "1.3.0": {
    "en": "New flow condition: “Headroom for device” to check if a device can safely increase its consumption by X kW."
  },
  "1.3.1": {
    "en": "More robust headroom calculation for device"
  },
  "1.3.2": {
    "en": "More robust headroom/shedding/restore calculations"
  },
  "1.3.3": {
    "en": "Disable logging of headroom calculations"
  },
  "1.3.4": {
    "en": "Fix regression in headroom calculations"
  },
  "1.4.0": {
    "en": "Upgrade the plan UI with more structured details"
  },
  "1.5.0": {
    "en": "Added configurable overshoot shedding per device (turn off vs minimum temperature), plus updated UI and docs to support it."
  },
  "1.5.2": {
    "en": "Gate sheds and swaps on measurements"
  },
  "1.5.3": {
    "en": "Coordinated price optimization and capacity planning, plus various bug‑fix tests and safeguards."
  },
  "1.5.4": {
    "en": "Improved plan behavior and clarity: plan status reasons simplified, shed temps validated on repeated overshoot, and power estimation unified for restore logic."
  },
  "1.5.5": {
    "en": "Large refactor of the codebase and various bugfixes."
  },
  "1.5.6": {
    "en": "Fix crash due to excessive CPU usage and converted more internals to use UTC."
  },
  "1.5.7": {
    "en": "Make statistics actually work."
  },
  "1.5.8": {
    "en": "Improved settings UI power usage visuals and labels, now using Homey’s timezone. Settings UI errors are logged to Homey. Plan view usage and clarity improvements."
  },
  "1.5.9": {
    "en": "Update app descriptions and doc fixes."
  },
  "1.6.0": {
    "en": "Added a soft daily energy budget feature with price‑shaped planning and limiter status, including a new “today plan” view and daily budget settings, while refining plan logic (freeze/settle behavior) and performance; refreshed Insights (limit reason/load split, removed deprecated capabilities), reorganized the settings UI, and introduced topic‑based debug logging and timezone handling fixes alongside assorted plan/UX cleanup."
  },
  "1.7.0": {
    "en": "Added new flow actions to enable and disable capacity control per device, giving you more flexibility to manage which devices participate in load shedding through automations. Fixed an issue where daily budget constraints could incorrectly trigger shortfall alerts - daily budget limits are now treated as soft constraints that won't cause emergency shedding. Improved the settings UI with a usage legend and better device control visibility."
  },
  "1.7.1": {
    "en": "Information previously only available when hovering over e.g chart bars is now available on touch interfaces as well."
  },
  "1.7.2": {
    "en": "Previously the 'Used X of Y kWh' line always showed the hourly capacity\nbudget, even when the system was constrained by daily budget. Now the UI shows the actual daily budget allocation for the current hour."
  },
  "1.7.3": {
    "en": "The Daily Budget panel has been refreshed with a today/tomorrow toggle, a clearer planned‑vs‑actual chart plus confidence chip, and a simplified summary that includes remaining/deviation and an estimated cost readout (now shown in NOK); tomorrow’s plan preview appears when prices are available; nettleie (grid tariff) fetching is more reliable thanks to fallback dates when the NVE API returns empty data, so price totals are less likely to go missing."
  },
  "1.7.4": {
    "en": "Added a new Flow action to set or disable the daily budget (kWh) so you can automate budget changes, and the settings UI now arranges tabs into two rows for better navigation."
  },
  "1.7.5": {
    "en": "Minor bug fixes"
  },
  "1.7.6": {
    "en": "PELS now reduces restore flapping by adding an exponential restore cooldown backoff (up to 5 minutes) after instability, improves shedding order so lower‑priority devices shed first even if higher‑priority devices were recently restored, makes daily budget deviation time‑weighted within the hour for more accurate “allowed so far” reporting, and simplifies device status messaging to show “keep” without priority while noting when a device was recently restored."
  },
  "1.8.0": {
    "en": "App’s price calculations and UI have been expanded to show a full hourly price breakdown: totals now include grid tariff energy component, provider surcharge (now defined as VAT‑inclusive), consumption tax, Enova fee, VAT, and electricity support (with regional rules like NO4 VAT exemption and reduced consumption tax in Troms/Finnmark), and the Price tab reflects this with clearer labels and hover tooltips that show the component breakdown per hour."
  },
  "1.8.1": {
    "en": "Add debug tools for cleaning up device states and device insights."
  }
}
