{
  "1.0.0": {
    "en": "First version!"
  },
  "1.0.1": {
    "en": "Take Homey's TZ into consideration in the UI"
  },
  "1.0.2": {
    "en": "Fixed devices not restoring during capacity shortfall. Burst rate now only limited in last 10 minutes of the hour. Added dry-run warning banner. Added end-of-hour indicator in plan view."
  },
  "1.0.3": {
    "en": "Improved settings UI with better spacing and navigation. Added stale data warning banner. Improved price display with collapsible summary. Renamed insights driver with new icon."
  },
  "1.0.4": {
    "en": "Fix shortfall detection during end of hour"
  },
  "1.0.5": {
    "en": "Renaming modes should now be safe"
  },
  "1.1.0": {
    "en": "Added new card for when operating mode changes"
  },
  "1.1.1": {
    "en": "Improved flow card UX: removed parentheses from report power card title and added helpful usage hints. All flow cards now provide clear guidance on how to use them with practical examples."
  },
  "1.2.0": {
    "en": "Add some new flow cards"
  },
  "1.3.0": {
    "en": "New flow condition: “Headroom for device” to check if a device can safely increase its consumption by X kW."
  },
  "1.3.1": {
    "en": "More robust headroom calculation for device"
  },
  "1.3.2": {
    "en": "More robust headroom/shedding/restore calculations"
  },
  "1.3.3": {
    "en": "Disable logging of headroom calculations"
  },
  "1.3.4": {
    "en": "Fix regression in headroom calculations"
  },
  "1.4.0": {
    "en": "Upgrade the plan UI with more structured details"
  },
  "1.5.0": {
    "en": "Added configurable overshoot shedding per device (turn off vs minimum temperature), plus updated UI and docs to support it."
  },
  "1.5.2": {
    "en": "Gate sheds and swaps on measurements"
  },
  "1.5.3": {
    "en": "Coordinated price optimization and capacity planning, plus various bug‑fix tests and safeguards."
  },
  "1.5.4": {
    "en": "Improved plan behavior and clarity: plan status reasons simplified, shed temps validated on repeated overshoot, and power estimation unified for restore logic."
  },
  "1.5.5": {
    "en": "Large refactor of the codebase and various bugfixes."
  }
}
